app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "short_description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Jeans"], ["price", #<BigDecimal:b6654c4c,'0.3E4',9(18)>], ["short_description", "Ladies slim fit jeans"], ["created_at", 2017-04-12 11:19:11 UTC], ["updated_at", 2017-04-12 11:19:11 UTC]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "products" SET "short_description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["short_description", "Women formal shirts"], ["updated_at", 2017-04-12 12:26:11 UTC], ["id", 5]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    @product = Product.find(params[:id])
    if @product.delete